# Practical No. 3

### Aim: Creating the Dataframe

In [2]:
#Name:Rudraksh K. Ramekar
#Roll no.:69
#Subject:ET1
#Sec:C
#Date:25/08/2025

# Creating series

In [3]:
import pandas as pd

In [4]:
Name=["rudrx","dev","vedant","amartya","pratik"]

In [5]:
Name

['rudrx', 'dev', 'vedant', 'amartya', 'pratik']

In [6]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1      rudrx
2        dev
3     vedant
4    amartya
5     pratik
dtype: object

# Creating DataFrame

In [7]:
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
               columns=["CD","DBMS","DSS","CAO"])

In [8]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [9]:
df.shape

(3, 4)

In [10]:
df.size

12

In [11]:
df.ndim

2

# Adding Record (Row)to the data frame

In [12]:
df2=pd.DataFrame([[10,12,14,16]],
columns=["CD","DBMS","DSS","CAO"])

In [17]:
df3=pd.concat([df,df2], ignore_index=True)

In [18]:
df3

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

# Deleting Record from df3 dataframe

In [19]:
df4=df3.drop(index=[1])

In [20]:
df4

   CD  DBMS  DSS  CAO
0  10    12   14   16
2  12    13   14   15
3  10    12   14   16

# Adding Attribute (columns)to data frame

In [21]:
df3["DM"]=[11,22,33,44]

In [22]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  11
1  11    18   15   21  22
2  12    13   14   15  33
3  10    12   14   16  44

# Deleting attribut (columns) from df3 dataframe

In [23]:
df5=df3.drop(columns=["DM"])

In [24]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

In [25]:
print("mean of dss:",df5["DSS"].mean())

mean of dss: 14.25

In [26]:
print("median of dss:",df5["DSS"].median())

median of dss: 14.0

In [27]:
print("mode of dss:",df5["DSS"].mode())

mode of dss: 0    14
Name: DSS, dtype: int64